app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($q !== '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id !== '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->paginate(10, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10

            $kategoriModel = new KategoriModel();
            $data = [
                'title'    => 'Tambah Artikel',
                'kategori' => $kategoriModel->findAll(),
---
SELECT *
FROM `kategori`

    public function edit($id)
    {
        $model = new ArtikelModel();
        if ($this->request->getMethod() === 'post' && $this->validate([
            'judul'        => 'required',
            'id_kategori'  => 'required|integer'
        ])) {
            $model->update($id, [
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'id_kategori' => $this->request->getPost('id_kategori')
            ]);
            return redirect()->to('/admin/artikel');
        } else {
            $data['artikel'] = $model->find($id);
            $kategoriModel = new KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'
SELECT *
FROM `kategori`

    public function delete($id)
    {
        $model = new ArtikelModel();
        $model->delete($id);
---
DELETE FROM `artikel`
WHERE `id` IN ('3')